import {Movie} from './interfaces/Movie';



export const movies: Movie[] = [
    {
        id: 1,
        name: 'Джентльмены',
        year: 2019,
        description: 'Один ушлый американец ещё со студенческих лет приторговывал наркотиками, а теперь придумал схему нелегального обогащения с использованием поместий обедневшей английской аристократии и очень неплохо на этом разбогател. Другой пронырливый журналист приходит к Рэю, правой руке американца, и предлагает тому купить киносценарий, в котором подробно описаны преступления его босса при участии других представителей лондонского криминального мира — партнёра-еврея, китайской диаспоры, чернокожих спортсменов и даже русского олигарха. ',
        rating: 9.02,
        category_id: 1,
        image: 'http://baskino.me/uploads/images/2020/901/xcur461.jpg'
    },
    {
        id: 2,
        name: 'Расплата',
        year: 2016,
        description: 'Кристиан Вульф — гениальный математик, который занимается аудитом влиятельных преступных организаций.',
        rating: 8.91,
        category_id: 1,
        image: 'http://baskino.me/uploads/images/2016/739/jrin448.jpg',
    },
    {
        id: 3,
        name: 'Бриллиантовая рука\n',
        year: 1968,
        description: 'Смотрите онлайн криминальную комедию «Бриллиантовая рука», снятую в 1968 году советским режиссером Леонидом Гайдаем.',
        rating: 8.86,
        category_id: 2,
        image: 'http://baskino.me/uploads/images/2012/237/oxpa942.jpg',
    },
    {
        id: 4,
        name: 'Собачья жизнь',
        year: 2017,
        description: 'В мире существует множество различных пород собак, и все они, независимо от мастей и размеров, являются верными и',
        rating: 9.03,
        category_id: 2,
        image: 'http://baskino.me/uploads/images/2017/348/omly185.jpg',
    },
    {
        id: 5,
        name: 'Тайна Коко',
        year: 2017,
        description: 'Мигель — двенадцатилетний мальчишка, который родился в семье сапожников и тайно мечтает стать музыкантом',
        rating: 8.09,
        category_id: 3,
        image: 'http://baskino.me/uploads/images/2017/431/mbie639.jpg',
    },
    {
        id: 6,
        name: 'Ходячий замок',
        year: 2004,
        description: 'Действия фильма происходят в параллельной реальности конца девятнадцатого века в Европе',
        rating: 8.74,
        category_id: 3,
        image: 'http://baskino.me/uploads/images/2014/668/otzc381.jpg',
    },
];
